driver-tests/bpelse/faulthandling/FaultHandlingJbi/test/FaultReply_Invoke/Input.xml

<soap:Envelope
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:tns="http://stc.com/snowboard-info"
xmlns:xs="http://www.w3.org/2001/XMLSchema">
<soap:Body>
<tns:GetEndorsingBoarder>
<tns:manufacturer>gh</tns:manufacturer>
<tns:model/>
</tns:GetEndorsingBoarder>
</soap:Body>
</soap:Envelope>